# GetFaceReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointOnEdgeFaceIntersection..::..GetFaceReference Method
PointOnEdgeFaceIntersection Class See Also
---
Get a copy of the face reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Reference GetFaceReference()
```

Visual Basic
---
```text
Public Function GetFaceReference As Reference
```

Visual C++
---
```text
public:
Reference^ GetFaceReference()
```

# See Also
PointOnEdgeFaceIntersection Class
Autodesk.Revit.DB Namespace